# GetSketchyLines Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetSketchyLines Method
View Class See Also
---
Returns the current sketchy lines settings for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ViewDisplaySketchyLines GetSketchyLines()
```

Visual Basic
---
```text
Public Function GetSketchyLines As ViewDisplaySketchyLines
```

Visual C++
---
```text
public:
ViewDisplaySketchyLines^ GetSketchyLines()
```

# ### Return Value
Current sketchy lines settings.
# See Also
View Class
Autodesk.Revit.DB Namespace